EDT_config/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>ТЧ_Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT_config/src/Documents/Продажи/Forms/ФормаДокумента/Module.bsl
// @strict-types

&НаКлиенте
Процедура ТЧ_ТоварыКоличествоПриИзменении(Элемент)
	ПересчетСтоимости();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ТоварыЦенаПриИзменении(Элемент)
	ПересчетСтоимости();
КонецПроцедуры


&НаКлиенте
Процедура ПересчетСтоимости()
	Цена = Элементы.ТЧ_Товары.ТекущиеДанные.Цена;
	Количество = Элементы.ТЧ_Товары.ТекущиеДанные.Количество;
	Элементы.ТЧ_Товары.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры
